const spades = [
  '🂡',
  '🂢',
  '🂣',
  '🂤',
  '🂥',
  '🂦',
  '🂧',
  '🂨',
  '🂩',
  '🂪',
  '🂫',
  '🂭',
  '🂮',
];

const hearts = [
  '🂱',
  '🂲',
  '🂳',
  '🂴',
  '🂵',
  '🂶',
  '🂷',
  '🂸',
  '🂹',
  '🂺',
  '🂻',
  '🂽',
  '🂾',
];

const diamonds = [
  '🃁',
  '🃂',
  '🃃',
  '🃄',
  '🃅',
  '🃆',
  '🃇',
  '🃈',
  '🃉',
  '🃊',
  '🃋',
  '🃍',
  '🃎',
];

const clubs = [
  '🃑',
  '🃒',
  '🃓',
  '🃔',
  '🃕',
  '🃖',
  '🃗',
  '🃘',
  '🃙',
  '🃚',
  '🃛',
  '🃝',
  '🃞'
];

export const ranks = [
  'Ace',
  '2',
  '3',
  '4',
  '5',
  '6',
  '7',
  '8',
  '9',
  '10',
  'Jack',
  'Queen',
  'King',
];

export const emojis = [spades, hearts, diamonds, clubs];
export const suits = ['spades', 'hearts', 'diamonds', 'clubs'];
